import React from 'react';
import '../sass/_intro.scss'


const Intro = (props) => {
    return <>
        <section className="intro section">
            <div className="intro__block">
                <div className="intro__title title-mark">
                    Кто мы?
                </div>
                <div className="content">
                    Ежегодно наша команда ведет переговоры относительно
                    сдачи в аренду или продажи десятков тысяч квадратных
                    метров офисных помещений.<br/>
                    <br/>
                    Большой опыт и знание работы
                    современного рынка помогает нам обеспечивать своих клиентов
                    самой точной и своевременной информацией, которая служит
                    основой для принятия оптимального и результативного решения.<br/>
                    <br/>
                    Наши специалисты имеют за плечами опыт работы как с российскими,
                    так и европейскими компаниями в сфере коммерческой недвижимости.
                </div>
            </div>
            <div className="intro__block">
                <div className="intro__title title-mark">
                    Наша деятельность
                </div>
                <div className="content">
                    Ежегодно наша команда ведет переговоры относительно
                    сдачи в аренду или продажи десятков тысяч квадратных
                    метров офисных помещений.<br/>
                    <br/>
                    Большой опыт и знание работы
                    современного рынка помогает нам обеспечивать своих клиентов
                    самой точной и своевременной информацией, которая служит
                    основой для принятия оптимального и результативного решения.<br/>
                    <br/>
                    Наши специалисты имеют за плечами опыт работы как с российскими,
                    так и европейскими компаниями в сфере коммерческой недвижимости.
                </div>
            </div>
        </section>
    </>
};

export default Intro;
