import React from 'react';
import '../sass/_preview.scss'

import img from '../img/bcBig.jpg'
import {useDispatch} from "react-redux";
import { showModal } from '../redux/actions'

const Preview = () => {
    const dispatch = useDispatch();
    return <>
        <div className="Preview__wrapper">
            <div className="Preview__img">
                <img className="img" src={img} alt=""/>
            </div>
            <div className="Preview__content">
                <ul className="Preview__content-list">
                    <li className="Preview__content-item">
                        <svg className="item-icon" viewBox="0 0 16 16">
                            <path stroke="#283655" d="M14 6.66699C14 11.3337 8 15.3337 8 15.3337C8 15.3337 2 11.3337 2 6.66699C2 5.07569 2.63214 3.54957 3.75736 2.42435C4.88258 1.29913 6.4087 0.666992 8 0.666992C9.5913 0.666992 11.1174 1.29913 12.2426 2.42435C13.3679 3.54957 14 5.07569 14 6.66699Z"  strokeWidth="0.5" strokeLinecap="round" strokeLinejoin="round"/>
                            <path stroke="#283655" d="M8 8.66699C9.10457 8.66699 10 7.77156 10 6.66699C10 5.56242 9.10457 4.66699 8 4.66699C6.89543 4.66699 6 5.56242 6 6.66699C6 7.77156 6.89543 8.66699 8 8.66699Z"  strokeWidth="0.5" strokeLinecap="round" strokeLinejoin="round"/>
                        </svg>
                        <span className="item-text">
                            г. Москва, Пресненская наб., 6, стр. 2<br/>
                            ЦАО, Пресненский район
                        </span>
                    </li>
                    <li className="Preview__content-item">
                        <svg className="item-icon" viewBox="0 0 21 21">
                            <path className="icon-path" d="M14.5204 3.06311L14.3438 3.06282L10.5898 10.4188L6.70076 3L1.37607 16.4023H0V17.4787H7.53861V16.4023H6.0428L7.53861 12.2136L10.5898 17.4787L13.5215 12.2136L15.0171 16.4023H13.5215V17.4787H21V16.4023H19.7044L14.5204 3.06311Z"/>
                        </svg>
                        <span className="item-text metro">
                           Выставочная
                        </span>
                    </li>
                    <li className="Preview__content-item">
                        <svg className="item-icon" viewBox="0 0 14 14">
                            <path className="icon-path" d="M2.33333 5.83301V9.91634H4.08333V5.83301H2.33333ZM5.83333 5.83301V9.91634H7.58333V5.83301H5.83333ZM1.16667 12.833H12.25V11.083H1.16667V12.833ZM9.33333 5.83301V9.91634H11.0833V5.83301H9.33333ZM6.70833 0.583008L1.16667 3.49967V4.66634H12.25V3.49967L6.70833 0.583008Z"/>
                        </svg>
                        <span className="item-text">
                           ИФНС №3
                        </span>
                    </li>
                    <li className="Preview__content-item">
                        <svg className="item-icon" viewBox="0 0 21 21">
                            <path className="icon-path" d="M18.375 5.25H14.875V2.625C14.875 2.39294 14.7828 2.17038 14.6187 2.00628C14.4546 1.84219 14.2321 1.75 14 1.75H7C6.76794 1.75 6.54538 1.84219 6.38128 2.00628C6.21719 2.17038 6.125 2.39294 6.125 2.625V8.75H2.625C2.39294 8.75 2.17038 8.84219 2.00628 9.00628C1.84219 9.17038 1.75 9.39294 1.75 9.625V16.625C1.75 16.8571 1.84219 17.0796 2.00628 17.2437C2.17038 17.4078 2.39294 17.5 2.625 17.5H18.375C18.6071 17.5 18.8296 17.4078 18.9937 17.2437C19.1578 17.0796 19.25 16.8571 19.25 16.625V6.125C19.25 5.89294 19.1578 5.67038 18.9937 5.50628C18.8296 5.34219 18.6071 5.25 18.375 5.25ZM5.25 15.75H3.5V14H5.25V15.75ZM5.25 12.25H3.5V10.5H5.25V12.25ZM9.625 15.75H7.875V14H9.625V15.75ZM9.625 12.25H7.875V10.5H9.625V12.25ZM9.625 8.75H7.875V7H9.625V8.75ZM9.625 5.25H7.875V3.5H9.625V5.25ZM13.125 15.75H11.375V14H13.125V15.75ZM13.125 12.25H11.375V10.5H13.125V12.25ZM13.125 8.75H11.375V7H13.125V8.75ZM13.125 5.25H11.375V3.5H13.125V5.25ZM17.5 15.75H15.75V14H17.5V15.75ZM17.5 12.25H15.75V10.5H17.5V12.25ZM17.5 8.75H15.75V7H17.5V8.75Z"/>
                        </svg>
                        <span className="item-text">
                           Этажность - 60
                        </span>
                    </li>
                    <li className="Preview__content-item">
                        <svg className="item-icon" viewBox="0 0 14 13">
                            <path className="icon-path" d="M7 0L8.5716 4.83688H13.6574L9.5429 7.82624L11.1145 12.6631L7 9.67376L2.8855 12.6631L4.4571 7.82624L0.342604 4.83688H5.4284L7 0Z"/>
                        </svg>
                        <span className="item-text">
                           Класс БЦ - A
                        </span>
                    </li>
                    <li className="Preview__content-item">
                        <svg className="item-icon" viewBox="0 0 21 21">
                            <path className="icon-path" d="M2.625 4.375V16.625C2.625 17.5901 3.40987 18.375 4.375 18.375H16.625C17.5901 18.375 18.375 17.5901 18.375 16.625V4.375C18.375 3.40987 17.5901 2.625 16.625 2.625H4.375C3.40987 2.625 2.625 3.40987 2.625 4.375ZM16.6268 16.625H4.375V4.375H16.625L16.6268 16.625Z"/>
                            <path className="icon-path" d="M13.125 10.5H14.875V6.125H10.5V7.875H13.125V10.5ZM10.5 13.125H7.875V10.5H6.125V14.875H10.5V13.125Z"/>
                        </svg>
                        <span className="item-text">
                           32 000 кв.м.
                        </span>
                    </li>
                </ul>
                <button className="btnCommon btnAnimate" onClick={() => dispatch(showModal())}>
                    <svg className="item-icon" viewBox="0 0 16 16">
                        <path className="icon-path" d="M14.6666 11.2797V13.2797C14.6674 13.4654 14.6294 13.6492 14.555 13.8193C14.4806 13.9894 14.3715 14.1421 14.2347 14.2676C14.0979 14.3932 13.9364 14.4887 13.7605 14.5482C13.5846 14.6077 13.3982 14.6298 13.2133 14.6131C11.1619 14.3902 9.19131 13.6892 7.45998 12.5664C5.84919 11.5428 4.48353 10.1772 3.45998 8.56641C2.33329 6.82721 1.63214 4.84707 1.41331 2.78641C1.39665 2.60205 1.41856 2.41625 1.47764 2.24082C1.53673 2.0654 1.63169 1.9042 1.75649 1.76749C1.88128 1.63077 2.03318 1.52155 2.2025 1.44675C2.37183 1.37196 2.55487 1.33325 2.73998 1.33307H4.73998C5.06351 1.32989 5.37717 1.44446 5.62248 1.65543C5.8678 1.8664 6.02803 2.15937 6.07331 2.47974C6.15772 3.11978 6.31428 3.74822 6.53998 4.35307C6.62967 4.59169 6.64908 4.85102 6.59591 5.10033C6.54274 5.34964 6.41922 5.57848 6.23998 5.75974L5.39331 6.60641C6.34235 8.27544 7.72428 9.65737 9.39331 10.6064L10.24 9.75974C10.4212 9.5805 10.6501 9.45697 10.8994 9.4038C11.1487 9.35063 11.408 9.37004 11.6466 9.45974C12.2515 9.68544 12.8799 9.84199 13.52 9.92641C13.8438 9.97209 14.1396 10.1352 14.351 10.3847C14.5624 10.6343 14.6748 10.9528 14.6666 11.2797Z" strokeLinecap="round" strokeLinejoin="round"/>
                    </svg>
                    <span>Заказать звонок</span>
                </button>
            </div>
        </div>
    </>
};



export default Preview;
